MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_gpio.c
  * @brief   GPIO HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the General Purpose Input/Output (GPIO) peripheral:
  *           + Initialization and de-initialization functions
  *           + I/O operation functions
  **********************************************************************************************************************
    * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (GPIOA) || defined (GPIOB) || defined (GPIOC) || defined (GPIOD) || defined (GPIOE) \
    || defined (GPIOF) ||  defined (GPIOG) || defined (GPIOH)
#if defined(USE_HAL_GPIO_MODULE) && (USE_HAL_GPIO_MODULE == 1U)

/** @addtogroup GPIO
  * @{
  */

/** @defgroup GPIO_Introduction GPIO Introduction
  * @{

  The GPIO hardware abstraction layer (HAL) provides a set of APIs to interface with the general-purpose
  Input/Output (GPIO) peripheral on STM32 microcontrollers.

  This layer simplifies the configuration, initialization, and management of GPIO pins, allowing multiple
  pins to be managed simultaneously when they belong to the same port.
  The GPIO includes the following features:

   - Initialize one or more GPIO pins.
   - Read the value of a pin.
   - Write values to one or more pins.
   - Toggle the state of pins.
   - Lock pins configuration.
   - Lock a set of pins.

  This abstraction layer ensures portability and ease of use across different STM32 series microcontrollers.
  * @}
  */

/** @defgroup GPIO_How_To_Use GPIO How To Use
  * @{

# GPIO features

- Configure each port bit of the general-purpose I/O (GPIO) ports in one of the following modes:
  - Input mode
  - Output mode
  - Alternate function mode
  - Analog mode

- After startup:
  - The alternate functions are inactive.
  - The I/O ports are configured in analog mode, with the exception of some pre-configured pins
  (debug pins, for instance).

- All GPIO pins have weak internal pull-up and pull-down resistors that can be activated or deactivated.

  - In output or alternate mode:
    - Configure each I/O for open-drain or push-pull type.
    - Select the I/O speed based on the VDD value.

- The microcontroller I/O pins are connected to onboard peripherals/modules through a multiplexer:
  - It allows only one peripheral (alternate function) to be connected to an I/O pin at a time. \n
  &rarr; No conflict occurs between peripherals sharing the same I/O pin.

- Use the LSE oscillator pins OSC32_IN and OSC32_OUT as general-purpose I/O when LSE is off.
\note The LSE has priority over the GPIO function.

<br>

6. Use the HSE oscillator pins OSC_IN/OSC_OUT as general-purpose I/O when HSE is off.
\note The HSE has priority over the GPIO function.

<br>

# How to use the GPIO HAL module driver

## Use the GPIO HAL driver as follows:

- Enable the GPIO peripheral clock:
  - Either at application level by calling the **HAL_RCC_GPIOx_EnableClock()** API
  - Or by setting the USE_HAL_GPIO_CLK_ENABLE_MODEL define in the HAL configuration file to:
      - HAL_CLK_ENABLE_PERIPH_ONLY or HAL_CLK_ENABLE_PERIPH_PWR_SYSTEM: in this case the GPIOx clock will be enabled
        within the HAL_GPIO_Init()

- Configure the GPIO pin(s) using HAL_GPIO_Init().
  - Set the I/O mode to the "mode" member from hal_gpio_config_t structure.
  - Select the pull-up or pull-down resistor using the "pull" member from hal_gpio_config_t structure.
  - For output or alternate function mode selection:
    - Configure the speed through the "speed" member from hal_gpio_config_t structure.
  - For alternate mode:
    - Configure the alternate function connected to the I/O through the "alternate"
    member from hal_gpio_config_t structure.
  - For output mode:
    - Configure the initial pin state through the "init_state" member from hal_gpio_config_t structure.
  - Select analog mode when a pin is used as an ADC channel input or as a DAC output.
  - For a GPIO pin with an external interrupt/event, use the HAL EXTI driver to configure the corresponding
    EXTI line.

- To reset the configuration of GPIO pin(s), use HAL_GPIO_DeInit().

- To get the level of a pin configured in input mode, use HAL_GPIO_ReadPin().

- To set/reset the level of pin(s) configured in output mode, use HAL_GPIO_WritePin() / HAL_GPIO_TogglePin().

- To set the level of several pins and reset the level of other pins in the same cycle,
 use HAL_GPIO_WriteMultipleStatePin().

- To lock a GPIO pin configuration until the next reset, use HAL_GPIO_LockPin().

- To get the selected GPIO hardware instance, use HAL_GPIO_GetLLInstance() function.

  */

/**
  * @}
  */

/** @defgroup GPIO_Configuration_Table GPIO Configuration Table
  * @{

# Configuration inside the GPIO driver

Config defines                | Description      | Default value         | Note
------------------------------| -----------------| --------------------- | --------------------------------------------
USE_HAL_GPIO_MODULE           | hal_conf.h       | 1                     | When set, HAL GPIO module is enabled
USE_HAL_CHECK_PARAM           | hal_conf.h       | 0                     | When set, parameters are checked at runtime
USE_ASSERT_DBG_PARAM          | PreProcessor env | NA                    | When defined, enable the params assert
USE_HAL_GPIO_CLK_ENABLE_MODEL | hal_conf.h       | HAL_CLK_ENABLE_NO     | Enable GPIO port clock in HAL_GPIO_Init
  */

/**
  * @}
  */

