MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.c
/* Private types -----------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Types GPIO Private Types
  * @{
  */

/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Constants GPIO Private Constants
  * @{
  */

#define GPIO_NUMBER                 (16U)   /*!< GPIO port pins number.               */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Macros GPIO Private Macros
  * @{
  */
/*! Macro to compute the clock enable mask from GPIO port */
#define GET_GPIO_CLK_ENABLE_BIT(port) ((1UL << (((port) & 0x03F00U) >> 10U)) << RCC_AHB2ENR_GPIOAEN_Pos)

/*! Macro to get the instance */
#define GPIO_GET_INSTANCE(instance)  ((GPIO_TypeDef *)((uint32_t)(instance)))

/*! Macro to check GPIO port validity */
#if defined(GPIOF) && defined(GPIOG)
#define IS_GPIO_PORT(port)  (((port) == HAL_GPIOA) \
                             || ((port) == HAL_GPIOB) \
                             || ((port) == HAL_GPIOC) \
                             || ((port) == HAL_GPIOD) \
                             || ((port) == HAL_GPIOE) \
                             || ((port) == HAL_GPIOF) \
                             || ((port) == HAL_GPIOG) \
                             || ((port) == HAL_GPIOH))
#else
#define IS_GPIO_PORT(port)  (((port) == HAL_GPIOA) \
                             || ((port) == HAL_GPIOB) \
                             || ((port) == HAL_GPIOC) \
                             || ((port) == HAL_GPIOD) \
                             || ((port) == HAL_GPIOE) \
                             || ((port) == HAL_GPIOH))
#endif /* GPIOF && GPIOG */

/*! Macro to check pin(s) validity */
#define IS_GPIO_PIN(pin)        ((((uint32_t)(pin) & HAL_GPIO_PIN_ALL) != 0x00U) \
                                 && (((uint32_t)(pin) & ~HAL_GPIO_PIN_ALL) == 0x00U))

/*! Macro to check one single pin validity */
#define IS_GPIO_SINGLE_PIN(pin)  (((pin) == HAL_GPIO_PIN_0) \
                                  || ((pin) == HAL_GPIO_PIN_1) \
                                  || ((pin) == HAL_GPIO_PIN_2) \
                                  || ((pin) == HAL_GPIO_PIN_3) \
                                  || ((pin) == HAL_GPIO_PIN_4) \
                                  || ((pin) == HAL_GPIO_PIN_5) \
                                  || ((pin) == HAL_GPIO_PIN_6) \
                                  || ((pin) == HAL_GPIO_PIN_7) \
                                  || ((pin) == HAL_GPIO_PIN_8) \
                                  || ((pin) == HAL_GPIO_PIN_9) \
                                  || ((pin) == HAL_GPIO_PIN_10) \
                                  || ((pin) == HAL_GPIO_PIN_11) \
                                  || ((pin) == HAL_GPIO_PIN_12) \
                                  || ((pin) == HAL_GPIO_PIN_13) \
                                  || ((pin) == HAL_GPIO_PIN_14) \
                                  || ((pin) == HAL_GPIO_PIN_15))

/*! Macro to check mode validity */
#define IS_GPIO_MODE(mode)  (((mode) == HAL_GPIO_MODE_INPUT) \
                             || ((mode) == HAL_GPIO_MODE_OUTPUT) \
                             || ((mode) == HAL_GPIO_MODE_ALTERNATE) \
                             || ((mode) == HAL_GPIO_MODE_ANALOG))

/*! Macro to check pull validity */
#define IS_GPIO_PULL(pull)  (((pull) == HAL_GPIO_PULL_NO) \
                             || ((pull) == HAL_GPIO_PULL_UP) \
                             || ((pull) == HAL_GPIO_PULL_DOWN))


/*! Macro to check speed validity */
#define IS_GPIO_SPEED(speed) (((speed) == HAL_GPIO_SPEED_FREQ_LOW) \
                              || ((speed) == HAL_GPIO_SPEED_FREQ_MEDIUM) \
                              || ((speed) == HAL_GPIO_SPEED_FREQ_HIGH) \
                              || ((speed) == HAL_GPIO_SPEED_FREQ_VERY_HIGH))

/*! Macro to check output type validity */
#define IS_GPIO_OUTPUT_TYPE(output_type)  (((output_type) == HAL_GPIO_OUTPUT_PUSHPULL) \
                                           || ((output_type) == HAL_GPIO_OUTPUT_OPENDRAIN))

/*! Macro to check alternate validity */
#define IS_GPIO_ALTERNATE(alternate)  (((alternate) == HAL_GPIO_AF_0) \
                                       || ((alternate) == HAL_GPIO_AF_1) \
                                       || ((alternate) == HAL_GPIO_AF_2) \
                                       || ((alternate) == HAL_GPIO_AF_3) \
                                       || ((alternate) == HAL_GPIO_AF_4) \
                                       || ((alternate) == HAL_GPIO_AF_5) \
                                       || ((alternate) == HAL_GPIO_AF_6) \
                                       || ((alternate) == HAL_GPIO_AF_7) \
                                       || ((alternate) == HAL_GPIO_AF_8) \
                                       || ((alternate) == HAL_GPIO_AF_9) \
                                       || ((alternate) == HAL_GPIO_AF_10) \
                                       || ((alternate) == HAL_GPIO_AF_11) \
                                       || ((alternate) == HAL_GPIO_AF_12) \
                                       || ((alternate) == HAL_GPIO_AF_13) \
                                       || ((alternate) == HAL_GPIO_AF_14) \
                                       || ((alternate) == HAL_GPIO_AF_15))

/*! Macro to check state validity */
#define IS_GPIO_PIN_STATE(state)   (((state)  ==  HAL_GPIO_PIN_SET) || ((state)  ==  HAL_GPIO_PIN_RESET))

/*! Macro to check pins overlap between those to set and those to reset */
#define IS_GPIO_COMMON_PIN(resetmask, setmask)  (((uint32_t)(resetmask) & (uint32_t)(setmask)) == 0x00u)

/**
  * @}
  */

/* Private variables -------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Variables GPIO Private Variables
  * @{
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @addtogroup GPIO_Exported_Functions
  * @{
  */

