MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.c
/** @addtogroup GPIO_Exported_Functions_Group1
  * @{
  * ## This subsection provides a set of functions allowing to initialize/de-initialize and configure GPIO ports.

### Initialize GPIO pins of a dedicated GPIO port using HAL_GPIO_Init():
  - Provide the GPIO port as a parameter.
  - Specify the GPIO pins to be configured, as a second parameter.
  - Provide the configuration structure containing the configuration to be applied as the third parameter.
### De-initialize GPIO pins of a dedicated GPIO port using HAL_GPIO_DeInit():
  - Provide the GPIO port as a first parameter.
  - Specify the GPIO pins to be de-initialized as a second parameter.
<br>
  */

/**
  * @brief  Initialize a pin or a set of pins for a GPIO port according to the specified parameters in the p_config.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param  pins specifies the port pins to be written.
  *         This parameter can be a combination of HAL_GPIO_PIN_x where x can be (0..15).
  * @param  p_config pointer to a @ref hal_gpio_config_t structure that contains
  *         the configuration information for the specified GPIO pins.
  * @retval HAL_INVALID_PARAM p_config is NULL.
  * @retval HAL_OK GPIO pins has been correctly configured.
  */
hal_status_t  HAL_GPIO_Init(hal_gpio_t gpiox, uint32_t pins, const hal_gpio_config_t *p_config)
{
  GPIO_TypeDef  *p_gpio;

  uint32_t tmp_pins_msk;
  uint32_t mode;
  uint32_t alternate;
  uint32_t position;
  uint32_t iocurrent;
  uint32_t io_msk;

  ASSERT_DBG_PARAM(IS_GPIO_PORT(gpiox));
  ASSERT_DBG_PARAM(IS_GPIO_PIN(pins));
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_GPIO_MODE(p_config->mode));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)

  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  tmp_pins_msk = pins;
  p_gpio = GPIO_GET_INSTANCE(gpiox);
  mode = (uint32_t)p_config->mode;
  alternate = (uint32_t)p_config->alternate;

  position = STM32_POSITION_VAL(tmp_pins_msk);     /* Get the first pin position from the pins mask */
  iocurrent = 1UL << position;                     /* Get the first pin from the pins mask */

#if defined (USE_HAL_GPIO_CLK_ENABLE_MODEL) && (USE_HAL_GPIO_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  LL_AHB2_GRP1_EnableClock(GET_GPIO_CLK_ENABLE_BIT((uint32_t)gpiox));
#endif /* USE_HAL_GPIO_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO */

  if (mode == LL_GPIO_MODE_OUTPUT)
  {
    ASSERT_DBG_PARAM(IS_GPIO_PIN_STATE(p_config->init_state));

    LL_GPIO_WriteOutputPin(p_gpio, pins, (uint32_t)p_config->init_state);
  }

  /* Configure the port pins */
  while (tmp_pins_msk != 0U)
  {
    /* The io_mask is identical to the current one */
    io_msk = iocurrent;

    if ((mode == LL_GPIO_MODE_OUTPUT) || (mode == LL_GPIO_MODE_ALTERNATE))
    {
      ASSERT_DBG_PARAM(IS_GPIO_SPEED(p_config->speed));
      ASSERT_DBG_PARAM(IS_GPIO_OUTPUT_TYPE(p_config->output_type));

      LL_GPIO_SetPinSpeed(p_gpio, io_msk, (uint32_t)p_config->speed);

      LL_GPIO_SetPinOutputType(p_gpio, io_msk, (uint32_t)p_config->output_type);
    }

    if ((mode != LL_GPIO_MODE_ANALOG) || ((mode == LL_GPIO_MODE_ANALOG) && (p_config->pull != HAL_GPIO_PULL_UP)))
    {
      ASSERT_DBG_PARAM(IS_GPIO_PULL(p_config->pull));

      LL_GPIO_SetPinPull(p_gpio, io_msk, (uint32_t)p_config->pull);
    }

    if (mode == LL_GPIO_MODE_ALTERNATE)
    {
      ASSERT_DBG_PARAM(IS_GPIO_ALTERNATE(p_config->alternate));

      if (io_msk < LL_GPIO_PIN_8)
      {
        LL_GPIO_SetAFPin_0_7(p_gpio, io_msk, alternate);
      }
      else
      {
        LL_GPIO_SetAFPin_8_15(p_gpio, io_msk, alternate);
      }
    }

    LL_GPIO_SetPinMode(p_gpio, io_msk, mode);

    tmp_pins_msk &= (~iocurrent);                   /* Clear the current pin from the pins mask */
    position = STM32_POSITION_VAL(tmp_pins_msk);    /* Get the next pin position from the pins mask */
    iocurrent = 1UL << position;                    /* Get the next pin from the pins mask */
  }
  return HAL_OK;
}

/**
  * @brief  Reset the configuration of a pin or a set of pins for a GPIO port to the default one.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param  pins specifies the port pins to be written.
  *         This parameter can be a combination of HAL_GPIO_PIN_x where x can be (0..15).
  */
void  HAL_GPIO_DeInit(hal_gpio_t gpiox, uint32_t pins)
{
  uint32_t tmp_pins_msk = pins;
  uint32_t position;
  uint32_t iocurrent;
  uint32_t io_msk;

  ASSERT_DBG_PARAM(IS_GPIO_PORT((gpiox)));
  ASSERT_DBG_PARAM(IS_GPIO_PIN(pins));

  GPIO_TypeDef  *p_gpio = GPIO_GET_INSTANCE(gpiox);

  position = STM32_POSITION_VAL(tmp_pins_msk);     /* Get the first pin position from the pins mask */
  iocurrent = 1UL << position;                     /* Get the first pin from the pins mask */

  LL_GPIO_WriteOutputPin(p_gpio, pins, LL_GPIO_PIN_RESET);

  while (tmp_pins_msk != 0U)
  {
    /* The io_mask is identical to the current one */
    io_msk = iocurrent;

    LL_GPIO_SetPinMode(p_gpio, io_msk, LL_GPIO_MODE_ANALOG);

    if (io_msk < LL_GPIO_PIN_8)
    {
      LL_GPIO_SetAFPin_0_7(p_gpio, io_msk, LL_GPIO_AF_0);
    }
    else
    {
      LL_GPIO_SetAFPin_8_15(p_gpio, io_msk, LL_GPIO_AF_0);
    }

    LL_GPIO_SetPinSpeed(p_gpio, io_msk, LL_GPIO_SPEED_FREQ_LOW);

    LL_GPIO_SetPinOutputType(p_gpio, io_msk, LL_GPIO_OUTPUT_PUSHPULL);

    LL_GPIO_SetPinPull(p_gpio, io_msk, LL_GPIO_PULL_NO);

    tmp_pins_msk &= (~iocurrent);                   /* Clear the current pin from the pins mask */
    position = STM32_POSITION_VAL(tmp_pins_msk);    /* Get the next pin position from the pins mask */
    iocurrent = 1UL << position;                    /* Get the next pin from the pins mask */
  }
}

/**
  * @}
  */

/** @addtogroup GPIO_Exported_Functions_Group2
  * @{
  * ## This subsection contains the APIs managing possible I/O operations on the GPIO pins:

### Read the input level of a dedicated input port pin using HAL_GPIO_ReadPin():
  - Provide the GPIO port as a first parameter.
  - Provide the GPIO pin to read as a second parameter.

### Set or clear a set of pins of a GPIO port using HAL_GPIO_WritePin():
  - Provide the GPIO port as a first parameter.
  - Specify the pins to be updated as a second parameter.
  - Enter the pin state to be written to the specified pin as the third parameter.

