MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.c
### Set and clear several pins of the same GPIO port in a single cycle using HAL_GPIO_WriteMultipleStatePin():
  - Provide the GPIO port as the first parameter.
  - Specify the set of pins to be reset as a second parameter.
  - Specify the set of pins to be set as a third parameter.

### Toggle a set of pins of a dedicated GPIO port using HAL_GPIO_TogglePin():
  - Provide the GPIO port as a first parameter.
  - Specify the set of pins to be toggled as a second parameter.

### Lock the configuration of a set of pins of a dedicated GPIO port using HAL_GPIO_LockPin():
  - Provide the GPIO port as a first parameter.
  - Specify the set of pins of which to lock the configuration as a second parameter.

### To get the selected GPIO hardware instance, use HAL_GPIO_GetLLInstance() function.

<br>
  */

/**
  * @brief  Read the specific input pin for a GPIO port.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param  pin specifies the port pin to read.
  *         This parameter can be one of HAL_GPIO_PIN_x where x can be (0..15).
  * @retval HAL_GPIO_PIN_RESET when the input port pin is low.
  * @retval HAL_GPIO_PIN_SET when the input port pin is high.
  */
hal_gpio_pin_state_t HAL_GPIO_ReadPin(hal_gpio_t gpiox, uint32_t pin)
{
  ASSERT_DBG_PARAM(IS_GPIO_PORT(gpiox));
  ASSERT_DBG_PARAM(IS_GPIO_SINGLE_PIN(pin));

  return (hal_gpio_pin_state_t)LL_GPIO_IsInputPinSet(GPIO_GET_INSTANCE(gpiox), pin);
}

/**
  * @brief  Set or clear a pin or a set of pins of a GPIO port.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param  pins specifies the port pins to be written.
  * @param  pin_state specifies the value to be written to the selected bit.
  *         This parameter can be one of the @ref hal_gpio_pin_state_t enum values:
  *            @arg HAL_GPIO_PIN_RESET: to clear the port pin.
  *            @arg HAL_GPIO_PIN_SET: to set the port pin.
  * @note   This function uses GPIOx_BSRR and GPIOx_BRR registers to allow atomic read/modify
  *         accesses. In this way, there is no risk of an IRQ occurring between
  *         the read and the modify access.
  */
void HAL_GPIO_WritePin(hal_gpio_t gpiox, uint32_t pins, hal_gpio_pin_state_t pin_state)
{
  ASSERT_DBG_PARAM(IS_GPIO_PORT(gpiox));
  ASSERT_DBG_PARAM(IS_GPIO_PIN(pins));
  ASSERT_DBG_PARAM(IS_GPIO_PIN_STATE(pin_state));

  LL_GPIO_WriteOutputPin(GPIO_GET_INSTANCE(gpiox), pins, (uint32_t)pin_state);
}

/**
  * @brief    Set and clear a pin or a set of pins of a GPIO port in same cycle.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param    pins_reset specifies the port bits to be reset.
  *           This parameter can be any combination of HAL_GPIO_PIN_x where x can be (0..15) or zero.
  * @param    pins_set specifies the port bits to be set.
  *           This parameter can be any combination of HAL_GPIO_PIN_x where x can be (0..15) or zero.
  * @note     This function uses GPIOx_BSRR register to set the level of several pins
  *           and reset level of several other pins in the same cycle.
  * @note     Ensure at least one of the two parameters used to set or reset is different from zero.
  * @warning  Do not set any common bit in pins_reset and pins_set combinations, otherwise the
  *           assert is triggered.
  */
void HAL_GPIO_WriteMultipleStatePin(hal_gpio_t gpiox, uint32_t pins_reset, uint32_t pins_set)
{
  /* Make sure at least one parameter is different from zero no common pin between set and reset mask */
  ASSERT_DBG_PARAM(IS_GPIO_PORT((gpiox)));
  ASSERT_DBG_PARAM(IS_GPIO_PIN((uint32_t)pins_reset | (uint32_t)pins_set));
  ASSERT_DBG_PARAM(IS_GPIO_COMMON_PIN(pins_reset, pins_set));

  LL_GPIO_WriteMultipleStatePin(GPIO_GET_INSTANCE(gpiox), pins_reset, pins_set);
}

/**
  * @brief  Toggle a specific pin of a GPIO port.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param  pins specifies the port pins to be toggled.
  *         This parameter can be a combination of HAL_GPIO_PIN_x where x can be (0..15).
  */
void  HAL_GPIO_TogglePin(hal_gpio_t gpiox, uint32_t pins)
{
  ASSERT_DBG_PARAM(IS_GPIO_PORT((gpiox)));
  ASSERT_DBG_PARAM(IS_GPIO_PIN(pins));

  LL_GPIO_TogglePin(GPIO_GET_INSTANCE(gpiox), pins);
}

/**
  * @brief  Lock the configuration of a pin or a set of pins of a GPIO port.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @param  pins specifies the port pins to be locked.
  *         This parameter can be any combination of HAL_GPIO_PIN_x where x can be (0..15).
  * @retval HAL_OK  pins locked successfully.
  * @retval HAL_ERROR  error occurred during pins lock operation.
  * @note   The locked registers are GPIOx_MODER, GPIOx_OTYPER, GPIOx_OSPEEDR,
  *         GPIOx_PUPDR, GPIOx_AFRL and GPIOx_AFRH.
  * @note   The configuration of the locked GPIO pins can no longer be modified
  *         until the next reset.
  */
hal_status_t  HAL_GPIO_LockPin(hal_gpio_t gpiox, uint32_t pins)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM(IS_GPIO_PORT(gpiox));
  ASSERT_DBG_PARAM(IS_GPIO_PIN(pins));

  GPIO_TypeDef  *p_gpio = GPIO_GET_INSTANCE(gpiox);

  /* In case of GPIO port, can lock all selected pins in one shot */
  LL_GPIO_LockPin(p_gpio, pins);

  if (LL_GPIO_IsAnyPinLocked(p_gpio) == 0UL)
  {
    status = HAL_ERROR;
  }

  return status;
}
/**
  * @}
  */

/**
  * @brief  Get the selected hardware GPIO instance.
  * @param  gpiox HAL_GPIOx: selected GPIO port based on @ref hal_gpio_t.
  * @retval The selected hardware GPIO instance.
  */
GPIO_TypeDef *HAL_GPIO_GetLLInstance(hal_gpio_t gpiox)
{
  ASSERT_DBG_PARAM(IS_GPIO_PORT(gpiox));

  return (GPIO_GET_INSTANCE(gpiox));
}


/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_GPIO_MODULE */
#endif /* GPIOA || GPIOB || GPIOC || GPIOD || GPIOE || GPIOF || GPIOG || GPIOH */
/**
  * @}
  */
